calumix/Chlorine_Sensor_Software/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RTD_CH_SEL0_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RTD_CH_SEL0_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_RTD_CH_SEL0_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RTD_CH_SEL0_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RTD_CH_SEL0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name FC3_TXD_SCL_MISO_WS (number 52), SPI_MISO
  @{ */
#define BOARD_INITPINS_SPI_MISO_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_MISO_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_MISO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_5 (number 56), ENTER_ISPn
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENTER_ISPn_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ENTER_ISPn_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ENTER_ISPn_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ENTER_ISPn_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ENTER_ISPn_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_6 (number 57), MEASURE_CSn
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MEASURE_CSn_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MEASURE_CSn_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_MEASURE_CSn_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MEASURE_CSn_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MEASURE_CSn_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_7 (number 1), VOLT_CURRn
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_VOLT_CURRn_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_VOLT_CURRn_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_VOLT_CURRn_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VOLT_CURRn_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VOLT_CURRn_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_8 (number 17), LED_ONn
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_ONn_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_ONn_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_ONn_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_ONn_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_ONn_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name FC1_CTS_SDA_SSEL0 (number 46), I2C_SDA
  @{ */
#define BOARD_INITPINS_I2C_SDA_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C_SDA_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C_SDA_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name FC1_RTS_SCL_SSEL1 (number 47), I2C_SCL
  @{ */
#define BOARD_INITPINS_I2C_SCL_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C_SCL_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C_SCL_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_15 (number 14), BTN2n
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BTN2n_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BTN2n_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BTN2n_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BTN2n_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BTN2n_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_17 (number 3), RTD_CSn
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RTD_CSn_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RTD_CSn_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_RTD_CSn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RTD_CSn_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RTD_CSn_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_19 (number 58), RTD_CH_SEL1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RTD_CH_SEL1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RTD_CH_SEL1_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_RTD_CH_SEL1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RTD_CH_SEL1_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RTD_CH_SEL1_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_20 (number 48), DBG
  @{ */

