calumix/Chlorine_Sensor_Software/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DBG_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DBG_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_DBG_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DBG_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DBG_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_21 (number 49), MEASURE_CH_SEL1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MEASURE_CH_SEL1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MEASURE_CH_SEL1_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_MEASURE_CH_SEL1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MEASURE_CH_SEL1_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MEASURE_CH_SEL1_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO0_22 (number 50), MEASURE_CH_SEL0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MEASURE_CH_SEL0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MEASURE_CH_SEL0_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_MEASURE_CH_SEL0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MEASURE_CH_SEL0_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MEASURE_CH_SEL0_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO0_26 (number 40), USB_POWERED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USB_POWERED_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_USB_POWERED_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_USB_POWERED_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_USB_POWERED_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_USB_POWERED_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name FC0_RXD_SDA_MOSI_DATA (number 59), PORT0_RXD
  @{ */
#define BOARD_INITPINS_PORT0_RXD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PORT0_RXD_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PORT0_RXD_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name FC0_TXD_SCL_MISO_WS (number 60), PORT0_TXD
  @{ */
#define BOARD_INITPINS_PORT0_TXD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PORT0_TXD_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PORT0_TXD_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_31 (number 15), BTN1n
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BTN1n_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BTN1n_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BTN1n_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BTN1n_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BTN1n_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name CAN0_TD (number 41), CAN_TD
  @{ */
#define BOARD_INITPINS_CAN_TD_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAN_TD_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAN_TD_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name CAN0_RD (number 42), CAN_RD
  @{ */
#define BOARD_INITPINS_CAN_RD_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAN_RD_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAN_RD_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
